DataProcessors/ФормированиеПредставленияЭлектронныхДокументовПОДДляДокументовБезФормуляров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>ФормированиеПредставленияЭлектронныхДокументовПОДДляДокументовБезФормуляров</Name>
			<Comment>Формирование представления ЭД для документов без формуляров</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Организация</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормироватьТолькоДляПроведенныхДокументовУчета</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ШаблоныДокументов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Шаблон</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ШаблоныПроцессов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторыПечатныхФорм</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ТекущиеСтатусыДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ТекущиеСтатусыДокументов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыДокументов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Шаблон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныПроцессов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Установил</Name>
					<Type>
						<v8:Type>cfg:TaskRef.ЗадачаПоОбработкеДокумента</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУстановки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Предмет</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПредметПроцессаОбработкиДокументов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПредметыДляФормированияФайловПредставленийФормуляровПОД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ПредметыДляФормированияФайловПредставленийФормуляровПОД</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Шаблон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныПроцессов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Предмет</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПредметПроцессаОбработкиДокументов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/НастройкиФормированияФайловПредставленийФормуляровПОД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>НастройкиФормированияФайловПредставленийФормуляровПОД</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИдентификаторыПечатныхФорм</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Шаблон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныПроцессов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/ФормированиеПредставленияЭлектронныхДокументовПОДДляДокументовБезФормуляров/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Перем ПараметрыОбработчикаОжидания, ФормаДлительнойОперации;

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.НачалоПериода = Дата(2020,1,1);
	Объект.КонецПериода = ТекущаяДатаСеанса();
	Объект.ФормироватьТолькоДляПроведенныхДокументовУчета = Истина;
	
	ЗагрузкаНастроекФормированияФайловПредставленийФормуляров();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СформироватьПредставлениеФормуляровЭД(Команда)
	Если НетЗамечанийПриПроверкеСпискаДокументовУчета() Тогда
		
		Результат = Ложь;
		ЗаданиеВыполнено = СформироватьФормулярыВФорматеPDFНаСервере();
		
		Если ЗаданиеВыполнено Тогда
			
			ПоказатьПредупреждение(Новый ОписаниеОповещения("ОбновитьДанныеПослеЗагрузки", ЭтотОбъект), НСтр("ru = 'Формирование представлений формуляров в формате PDF и MXL завершено. Подробности - в журнале регистрации'"));
			Возврат;
			
		КонецЕсли;
		
		ПараметрыОбработчикаОжидания = Новый Структура(
		"МинимальныйИнтервал,
		|МаксимальныйИнтервал,
		|ТекущийИнтервал,
		|КоэффициентУвеличенияИнтервала", 
		1, 15, 1, 1.4);
		ПодключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеЗадания", 1, Истина);
		ФормаДлительнойОперации = ОткрытьФорму("ОбщаяФорма.ДлительнаяОперация",
		Новый Структура("ИдентификаторЗадания", ИдентификаторЗадания), ЭтотОбъект);
	Иначе
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru='Все документы учета обработаны (представления формуляров созданы) или необходимо заполнить список документов, для которых формируются представления формуляра ЭД (шаг 4) и повторить попытку.'");
		Сообщение.Сообщить();
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИдентификаторыПечатныхФорм(Команда)

	ТекущаяСтрока = Элементы.ШаблоныДокументов.ТекущиеДанные;
	
	Если ТекущаяСтрока <> Неопределено Тогда
		ШаблонПОД = ТекущаяСтрока.Шаблон;
	Иначе
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru='Не выбран шаблон.'");
		Сообщение.Сообщить();
		
		Возврат;
	КонецЕсли;

	ТекущаяСтрока.ИдентификаторыПечатныхФорм = ИдентификаторыПечатныхФормШаблона(ШаблонПОД);
	
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьСписокПечатныхФормДляШаблона(Команда)
	ТекущаяСтрока = Элементы.ШаблоныДокументов.ТекущиеДанные;
	
	Если ТекущаяСтрока <> Неопределено Тогда
		ШаблонПОД = ТекущаяСтрока.Шаблон;
		ИдентификаторыПФ = ТекущаяСтрока.ИдентификаторыПечатныхФорм;
	Иначе
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru='Не выбран шаблон.'");
		Сообщение.Сообщить();
		
		Возврат;
	КонецЕсли;
	
	РедактироватьСписокПечатныхФормДляШаблонаНаСервере(ШаблонПОД, ИдентификаторыПФ);
	
	ДопПараметры = Новый Структура("ВыбранноеЗначение", ТекущаяСтрока);
	ОповещениеПослеВыбораИдентификаторовПФ = Новый ОписаниеОповещения("ЗаполнитьРезультатВыбораИдентификаторовПФ", ЭтотОбъект, ДопПараметры);

	ИдентификаторыПФ.ПоказатьОтметкуЭлементов(ОповещениеПослеВыбораИдентификаторовПФ, "Выберите печатные формы для шаблона");
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСписокШаблоновПоДокументамУчетаЗаПериод(Команда)
	ЗаполнитьСписокШаблоновПоДокументамУчетаЗаПериодНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСписокИспользуемыхШаблонов(Команда)
	ЗаполнитьСписокИспользуемыхШаблоновНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНастройкиСпискаПечатныхФормДляШаблонов(Команда)
	СохранитьНастройкиСпискаПечатныхФормДляШаблоновНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СформироватьСписокДокументовУчетаДляСозданияПредставленийФормуляров(Команда)
	
	Если НетЗамечанийПриПроверке() Тогда
		
		Результат = Ложь;
		СформироватьСписокДокументовУчетаДляСозданияПредставленийФормуляров = СформироватьСписокДокументовУчетаДляСозданияФормуляровВФорматеPDFНаСервере();
		
		Если ЗаданиеЗаполненияСпискаДокументовВыполнено Тогда
			
			ПоказатьПредупреждение(Новый ОписаниеОповещения("ОбновитьДанныеПослеЗагрузки", ЭтотОбъект), НСтр("ru = 'Заполнение списка документов учета для формирования представлений формуляров в формате PDF и MXL завершено.
			|Подробности - в журнале регистрации'"));
			Возврат;
			
		КонецЕсли;
		
		ПараметрыОбработчикаОжидания = Новый Структура(
		"МинимальныйИнтервал,
		|МаксимальныйИнтервал,
		|ТекущийИнтервал,
		|КоэффициентУвеличенияИнтервала", 
		1, 15, 1, 1.4);
		ПодключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеЗаданияЗаполненияСпискаДокументовУчета", 1, Истина);
		ФормаДлительнойОперации = ОткрытьФорму("ОбщаяФорма.ДлительнаяОперация",
		Новый Структура("ИдентификаторЗадания", ИдентификаторЗадания), ЭтотОбъект);
		
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция СформироватьФормулярыВФорматеPDFНаСервере()
	АдресХранилища = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);
	ЗаданиеВыполнено = Ложь;	

	НаименованиеЗадания = НСтр("ru = 'Формирование файлов представлений формуляров в формате PDF и MXL для электронных документов прошлых периодов'");
	
	ПараметрыОбработки = Новый Структура;
	
	ПараметрыЭкспортнойПроцедуры = Новый Массив;
	ПараметрыЭкспортнойПроцедуры.Добавить(ПараметрыОбработки);
	ПараметрыЭкспортнойПроцедуры.Добавить(АдресХранилища);
	
	Если ПолучитьСкоростьКлиентскогоСоединения() = СкоростьКлиентскогоСоединения.Низкая Тогда
		ВремяОжидания = 4;
	Иначе
		ВремяОжидания = 2;
	КонецЕсли;
		
	Задание = ФоновыеЗадания.Выполнить(
	"ПроцессыОбработкиДокументов.СформироватьПредставлениеФормуляровЭДДляДокументовПрошлыхПериодов", 
		ПараметрыЭкспортнойПроцедуры, УникальныйИдентификатор, НаименованиеЗадания);
	Попытка
		Задание.ОжидатьЗавершения(ВремяОжидания);
	Исключение		
		// Специальная обработка не требуется. Предположительно, исключение вызвано истечением времени ожидания.
	КонецПопытки;
		
	ИдентификаторЗадания = Задание.УникальныйИдентификатор;
	
	Если ДлительныеОперации.ЗаданиеВыполнено(Задание.УникальныйИдентификатор) Тогда
		ЗаданиеВыполнено = Истина; 
	КонецЕсли;	
	
	Возврат ЗаданиеВыполнено;
	
КонецФункции

&НаСервере
Функция СформироватьСписокДокументовУчетаДляСозданияФормуляровВФорматеPDFНаСервере()
	
	АдресХранилищаЗадания = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);
	ЗаданиеЗаполненияСпискаДокументовВыполнено = Ложь;	

	НаименованиеЗадания = НСтр("ru = 'Заполнение списка документов учета для формирования файлов представлений формуляров в формате PDF и MXL для электронных документов прошлых периодов'");
	
	ПараметрыОбработки = Новый Структура;
	ПараметрыОбработки.Вставить("ФормироватьТолькоДляПроведенныхДокументовУчета", Объект.ФормироватьТолькоДляПроведенныхДокументовУчета);
	ПараметрыОбработки.Вставить("НачалоПериода", Объект.НачалоПериода);
	ПараметрыОбработки.Вставить("КонецПериода", Объект.КонецПериода);
	
	ПараметрыЭкспортнойПроцедуры = Новый Массив;
	ПараметрыЭкспортнойПроцедуры.Добавить(ПараметрыОбработки);
	ПараметрыЭкспортнойПроцедуры.Добавить(АдресХранилищаЗадания);
	
	Если ПолучитьСкоростьКлиентскогоСоединения() = СкоростьКлиентскогоСоединения.Низкая Тогда
		ВремяОжидания = 4;
	Иначе
		ВремяОжидания = 2;
	КонецЕсли;
		
	Задание = ФоновыеЗадания.Выполнить(
	"ПроцессыОбработкиДокументов.ЗаполнитьСписокДокументовУчетаДляФормированияПредставленияФормуляровЭДДляДокументовПрошлыхПериодов", 
		ПараметрыЭкспортнойПроцедуры, УникальныйИдентификатор, НаименованиеЗадания);
	Попытка
		Задание.ОжидатьЗавершения(ВремяОжидания);
	Исключение		
		// Специальная обработка не требуется. Предположительно, исключение вызвано истечением времени ожидания.
	КонецПопытки;
		
	ИдентификаторЗадания = Задание.УникальныйИдентификатор;
	
	Если ДлительныеОперации.ЗаданиеВыполнено(Задание.УникальныйИдентификатор) Тогда
		ЗаданиеЗаполненияСпискаДокументовВыполнено = Истина; 
	КонецЕсли;	
	
	Возврат ЗаданиеЗаполненияСпискаДокументовВыполнено;

КонецФункции
	
&НаКлиенте
Процедура Подключаемый_ПроверитьВыполнениеЗадания()
	
	Попытка
		Если ПроверитьВыполнениеФоновогоЗаданияНаСервере(ИдентификаторЗадания) Тогда
			ДлительныеОперацииКлиент.ЗакрытьФормуДлительнойОперации(ФормаДлительнойОперации);
			
			ПоказатьПредупреждение(Неопределено, НСтр("ru = 'Формирование представлений формуляров в формате PDF и MXL для электронных документов прошлых периодов завершено. Подробности - в журнале регистрации'"));
			Возврат;
			
		КонецЕсли;

	Исключение
		ДлительныеОперацииКлиент.ЗакрытьФормуДлительнойОперации(ФормаДлительнойОперации);
		ВызватьИсключение;
	КонецПопытки;
	
	ПараметрыОбработчикаОжидания.ТекущийИнтервал = ПараметрыОбработчикаОжидания.ТекущийИнтервал * ПараметрыОбработчикаОжидания.КоэффициентУвеличенияИнтервала;
	Если ПараметрыОбработчикаОжидания.ТекущийИнтервал > ПараметрыОбработчикаОжидания.МаксимальныйИнтервал Тогда
		ПараметрыОбработчикаОжидания.ТекущийИнтервал = ПараметрыОбработчикаОжидания.МаксимальныйИнтервал;
	КонецЕсли;
	ПодключитьОбработчикОжидания(
		"Подключаемый_ПроверитьВыполнениеЗадания", 
		ПараметрыОбработчикаОжидания.ТекущийИнтервал, 
		Истина);
		
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПроверитьВыполнениеЗаданияЗаполненияСпискаДокументовУчета()
	
	Попытка
		Если ПроверитьВыполнениеФоновогоЗаданияНаСервере(ИдентификаторЗадания) Тогда
			ДлительныеОперацииКлиент.ЗакрытьФормуДлительнойОперации(ФормаДлительнойОперации);
			
			ПоказатьПредупреждение(Неопределено, НСтр("ru = 'Заполнение списка документов учета для формирования представлений формуляров в формате PDF и MXL для электронных документов прошлых периодов завершено. Подробности - в журнале регистрации'"));
			Возврат;
			
		КонецЕсли;

	Исключение
		ДлительныеОперацииКлиент.ЗакрытьФормуДлительнойОперации(ФормаДлительнойОперации);
		ВызватьИсключение;
	КонецПопытки;
	
	ПараметрыОбработчикаОжидания.ТекущийИнтервал = ПараметрыОбработчикаОжидания.ТекущийИнтервал * ПараметрыОбработчикаОжидания.КоэффициентУвеличенияИнтервала;
	Если ПараметрыОбработчикаОжидания.ТекущийИнтервал > ПараметрыОбработчикаОжидания.МаксимальныйИнтервал Тогда
		ПараметрыОбработчикаОжидания.ТекущийИнтервал = ПараметрыОбработчикаОжидания.МаксимальныйИнтервал;
	КонецЕсли;
	ПодключитьОбработчикОжидания(
		"Подключаемый_ПроверитьВыполнениеЗаданияЗаполненияСпискаДокументовУчета", 
		ПараметрыОбработчикаОжидания.ТекущийИнтервал, 
		Истина);
		
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПроверитьВыполнениеФоновогоЗаданияНаСервере(ФоновоеЗаданиеИдентификатор)
	Возврат ДлительныеОперации.ЗаданиеВыполнено(ФоновоеЗаданиеИдентификатор);
КонецФункции

&НаКлиенте
Процедура ОбновитьДанныеПослеЗагрузки(Параметр) Экспорт 

	УстановитьВидимостьЭлементов(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьЭлементов(Форма)

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		"ГруппаОбщиеНастройки", "Доступность", Форма.ЗаданиеВыполнено);

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		"ГруппаШаблоныИНастройкиФормированияПечатныхФормПредставленийФормуляров", "Доступность", Форма.ЗаданиеВыполнено);

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		"ГруппаЗаполнениеСпискаДокументовПОДДляОбработки", "Доступность", Форма.ЗаданиеВыполнено);

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы,
		"ГруппаФормированиеПредставленийФормуляров", "Доступность", Форма.ЗаданиеВыполнено);
	
КонецПроцедуры

&НаСервере
Функция ИдентификаторыПечатныхФормШаблонов(ШаблоныПОД)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ШаблоныПроцессовЭтапы.ИдентификаторыКомандПечатиСоШтампом КАК ИдентификаторыКомандПечатиСоШтампом,
	               |	ШаблоныПроцессовЭтапы.Ссылка КАК Шаблон
	               |ИЗ
	               |	Справочник.ШаблоныПроцессов.Этапы КАК ШаблоныПроцессовЭтапы
	               |ГДЕ
	               |	ШаблоныПроцессовЭтапы.Ссылка В(&Шаблоны)";

	Запрос.УстановитьПараметр("Шаблоны", ШаблоныПОД);
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

&НаСервере
Функция ИдентификаторыПечатныхФормШаблона(ШаблонПОД)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ШаблоныПроцессовЭтапы.ИдентификаторыКомандПечатиСоШтампом КАК ИдентификаторыКомандПечатиСоШтампом,
	               |	ШаблоныПроцессовЭтапы.Ссылка КАК Шаблон
	               |ИЗ
	               |	Справочник.ШаблоныПроцессов.Этапы КАК ШаблоныПроцессовЭтапы
	               |ГДЕ
	               |	ШаблоныПроцессовЭтапы.Ссылка = &Шаблон";

	Запрос.УстановитьПараметр("Шаблон", ШаблонПОД);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Результат = "";
	Если Выборка.Следующий() Тогда
		Результат = Выборка.ИдентификаторыКомандПечатиСоШтампом;
	КонецЕсли;	
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьИдентификаторыПечатныхФормДляПредставленийЭД(ШаблоныПОД)
	ШаблоныИИдентификаторыПечатныхФорм = ИдентификаторыПечатныхФормШаблонов(ШаблоныПОД);
	
	Для Каждого ТекШаблон Из Объект.ШаблоныДокументов Цикл
		Отбор = Новый Структура("Шаблон", ТекШаблон.Шаблон);
		МассивИдентификаторовПФШаблона = ШаблоныИИдентификаторыПечатныхФорм.НайтиСтроки(Отбор);
		МассивПФ = Новый Массив;
		
		Для Каждого ТекСтрока Из МассивИдентификаторовПФШаблона Цикл
			ОтмеченныеФормы =  ТекСтрока.ИдентификаторыКомандПечатиСоШтампом;
			Если ЗначениеЗаполнено(ОтмеченныеФормы) Тогда
				ИдентификаторыКомандПечатиСоШтампом = СтрРазделить(ОтмеченныеФормы, ",");
				ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивПФ, ИдентификаторыКомандПечатиСоШтампом, Истина);
			КонецЕсли;
		КонецЦикла;
		
		ТекШаблон.ИдентификаторыПечатныхФорм = СтрСоединить(МассивПФ, ",");
	КонецЦикла;	
	
КонецПроцедуры	

Функция ДвоичныеДанныеПредставленияДокументаПОД(ОбъектУчета, ИдентификаторКомандыПечати, Формат, ВыводитьШтампыЭлектронныхПодписейПриПечати) Экспорт
 	МодульУправлениеПечатью = ОбщегоНазначения.ОбщийМодуль("УправлениеПечатью");

	МетаданныеОбъекта = ОбъектУчета.Метаданные();
	
	ПолноеИмяФормы = МетаданныеОбъекта.ОсновнаяФормаОбъекта.Имя;
	СписокОбъектов = Новый Массив();
	СписокОбъектов.Добавить(МетаданныеОбъекта);
	
	КомандыПечати = МодульУправлениеПечатью.КомандыПечатиФормы(ПолноеИмяФормы, СписокОбъектов);
	НайденнаяКоманда = КомандыПечати.Найти(ИдентификаторКомандыПечати, "Идентификатор");
	Если НайденнаяКоманда = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	КомандаПечатиВФайл = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(НайденнаяКоманда);

	Если НЕ ВыводитьШтампыЭлектронныхПодписейПриПечати Тогда
		КомандаПечатиВФайл.ДополнительныеПараметры.Вставить("ИсключитьШтампы");
	КонецЕсли;	
	
	МассивОбъектовУчета = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ОбъектУчета);
	
	НастройкиСохранения = МодульУправлениеПечатью.НастройкиСохранения();
	НастройкиСохранения.ФорматыСохранения.Добавить(Формат);
	
	РезультатПечати = Неопределено;
	Попытка
		РезультатПечати = МодульУправлениеПечатью.НапечататьВФайл(КомандаПечатиВФайл, МассивОбъектовУчета, НастройкиСохранения);
	Исключение
		ТекстСообщения  = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Не удалось сформировать на сервере печатную форму ""%1"" для формуляра документа ""%2"".'"), НайденнаяКоманда, ОбъектУчета);
		Сообщение       = Новый СообщениеПользователю();
		Сообщение.Текст = ТекстСообщения;
		Сообщение.Сообщить();
	КонецПопытки;
	
	Если ЗначениеЗаполнено(РезультатПечати) Тогда
		Возврат РезультатПечати[0].ДвоичныеДанные;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

&НаСервере
Процедура РедактироватьСписокПечатныхФормДляШаблонаНаСервере(ШаблонПОД, ИдентификаторыВыбранныхПечатныхФорм)
	
	ШаблоныПОД = Новый Массив;
	ШаблоныПОД.Добавить(ШаблонПОД);
	ШаблоныИИдентификаторыПечатныхФорм = ИдентификаторыПечатныхФормШаблонов(ШаблоныПОД);
	ИдентификаторДокумента = ШаблонПОД.ИдентификаторДокумента;
	
	МодульУправлениеПечатью = ОбщегоНазначения.ОбщийМодуль("УправлениеПечатью");
	
	ОбъектМетаданных = ОбщегоНазначения.ОбъектМетаданныхПоИдентификатору(ИдентификаторДокумента);
	ИсточникиКомандПечати = МодульУправлениеПечатью.ИсточникиКомандПечати();
	Если ИсточникиКомандПечати.Найти(ОбъектМетаданных) = Неопределено Тогда
		КомандыПечати = Новый Массив;
	Иначе
		КомандыПечати = МодульУправлениеПечатью.КомандыПечатиОбъекта(ОбъектМетаданных);
	КонецЕсли;
	
	ИдентификаторыПФДляФормированияФормуляров = СтрРазделить(ИдентификаторыВыбранныхПечатныхФорм, ",", Ложь);	
	
	ИдентификаторыПФ = Новый СписокЗначений;
	
	Для Каждого ТекСтрока Из КомандыПечати Цикл
		ИдентификаторПФ = ТекСтрока.Идентификатор;
		Пометка = Истина;
		ИндексПФ = ИдентификаторыПФДляФормированияФормуляров.Найти(ИдентификаторПФ);
		Если ИндексПФ = Неопределено Тогда
			Пометка = Ложь;
		КонецЕсли;
		
		ИдентификаторыПФ.Добавить(ИдентификаторПФ, ТекСтрока.Представление, Пометка);
	КонецЦикла;	
	
	ИдентификаторыВыбранныхПечатныхФорм = ИдентификаторыПФ;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьРезультатВыбораИдентификаторовПФ(Элементы, Параметры) Экспорт
	ВыбранныеПечатныеФормы = Новый Массив;
	
	Результат = "";
	Если НЕ Элементы = Неопределено Тогда
		Для Каждого ВыбранныйИдентификаторПФ Из Элементы Цикл
			Если ВыбранныйИдентификаторПФ.Пометка Тогда
				ВыбранныеПечатныеФормы.Добавить(ВыбранныйИдентификаторПФ.Значение);
			КонецЕсли;	
		КонецЦикла;
	Иначе
		Возврат;
	КонецЕсли;
	
	Результат = СтрСоединить(ВыбранныеПечатныеФормы, ",");
	
	Параметры.ВыбранноеЗначение.ИдентификаторыПечатныхФорм = Результат;
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьШаблоныПоДокументамДляФормированияПредставленияФормуляров()
	ЗаполненПериод = Истина;
	Если Объект.НачалоПериода = Дата(1,1,1) Тогда
		ЗаполненПериод = Ложь;
	КонецЕсли;	

	Если Объект.КонецПериода = Дата(1,1,1) Тогда
		ЗаполненПериод = Ложь;
	КонецЕсли;
	
	Если НЕ ЗаполненПериод Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru='Не заполнен период подписания документов!'");
		Сообщение.Сообщить();
		
		Возврат;
	КонецЕсли;	
	
	Объект.ШаблоныДокументов.Очистить();
	
	Запрос = Новый Запрос;
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ТекущиеСтатусыДокументов.Шаблон КАК Шаблон
	|ИЗ
	|	РегистрСведений.ТекущиеСтатусыДокументов КАК ТекущиеСтатусыДокументов
	|ГДЕ
	|	ТекущиеСтатусыДокументов.ДатаУстановки МЕЖДУ &НачалоПериода И &ОкончаниеПериода
	|	И ИСТИНА";
	
	Если НЕ Объект.ФормироватьТолькоДляПроведенныхДокументовУчета Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ТекущиеСтатусыДокументов.Предмет.Проведен = ИСТИНА", "ИСТИНА");
	КонецЕсли;	
	
	Запрос.Текст = ТекстЗапроса;
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(Объект.НачалоПериода));
	Запрос.УстановитьПараметр("ОкончаниеПериода", КонецДня(Объект.КонецПериода));
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Объект.ШаблоныДокументов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	КонецЦикла;	

	ШаблоныОтбора = Объект.ШаблоныДокументов.Выгрузить();
	ШаблоныПОД = ШаблоныОтбора.ВыгрузитьКолонку("Шаблон");	
	ЗаполнитьИдентификаторыПечатныхФормДляПредставленийЭД(ШаблоныПОД);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокИспользуемыхШаблоновПОД()
	
	Объект.ШаблоныДокументов.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ШаблоныПроцессов.Ссылка КАК Шаблон
	               |ИЗ
	               |	Справочник.ШаблоныПроцессов КАК ШаблоныПроцессов
	               |ГДЕ
	               |	ШаблоныПроцессов.ПометкаУдаления = ЛОЖЬ
	               |	И ШаблоныПроцессов.НеИспользуется = ЛОЖЬ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Объект.ШаблоныДокументов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	КонецЦикла;	

	ШаблоныОтбора = Объект.ШаблоныДокументов.Выгрузить();
	ШаблоныПОД = ШаблоныОтбора.ВыгрузитьКолонку("Шаблон");	
	ЗаполнитьИдентификаторыПечатныхФормДляПредставленийЭД(ШаблоныПОД);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокШаблоновПоДокументамУчетаЗаПериодНаСервере()
	ЗаполнитьШаблоныПоДокументамДляФормированияПредставленияФормуляров();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокИспользуемыхШаблоновНаСервере()
	ЗаполнитьСписокИспользуемыхШаблоновПОД();
КонецПроцедуры

&НаСервере
Процедура ШаблоныДокументовШаблонПриИзмененииНаСервере(ШаблонПОД, ИдентификаторыПечатныхФорм)

	ШаблоныПОД = Новый Массив;
	ШаблоныПОД.Добавить(ШаблонПОД);
	ШаблоныИИдентификаторыПечатныхФорм = ИдентификаторыПечатныхФормШаблонов(ШаблоныПОД);
	ИдентификаторыПечатныхФорм = "";
	Если ШаблоныИИдентификаторыПечатныхФорм.Количество() > 0 Тогда
		ИдентификаторыПечатныхФорм = ШаблоныИИдентификаторыПечатныхФорм[0].ИдентификаторыКомандПечатиСоШтампом;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ШаблоныДокументовШаблонПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.ШаблоныДокументов.ТекущиеДанные;
	
	Если ТекущаяСтрока <> Неопределено Тогда
		ШаблонПОД = ТекущаяСтрока.Шаблон;
		ИдентификаторыПФ = ТекущаяСтрока.ИдентификаторыПечатныхФорм;
	Иначе
		Возврат;
	КонецЕсли;
	
	ИдентификаторыПечатныхФорм = ТекущаяСтрока.ИдентификаторыПечатныхФорм;
	ШаблоныДокументовШаблонПриИзмененииНаСервере(ШаблонПОД, ИдентификаторыПечатныхФорм);
	ТекущаяСтрока.ИдентификаторыПечатныхФорм = ИдентификаторыПечатныхФорм;
	
КонецПроцедуры

&НаСервере
Функция НетЗамечанийПриПроверке()
	Результат = Истина;

	НастройкиФормированияФормуляров = ПроцессыОбработкиДокументов.НастройкиФормированияФайловПредставленийФормуляровДокументовПрошлыхПериодов();
	
	НомСтроки = 0;
	НеУказаныПФ = Ложь;
	Для Каждого ТекСтрока Из НастройкиФормированияФормуляров Цикл
		НомСтроки = НомСтроки + 1;
		Если НЕ ЗначениеЗаполнено(ТекСтрока.ИдентификаторыПечатныхФорм) Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Для шаблона процесса %1 (строка № %2) не указаны печатные формы для создания представлений формуляра ЭД.'"), ТекСтрока.Шаблон, НомСтроки);
			Сообщение.Сообщить();
			
			НеУказаныПФ = Истина;
		КонецЕсли;	
	КонецЦикла;	
	
	Если НеУказаныПФ Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru='Необходимо указать печатные формы, которые формируются на сервере, для создания представлений формуляра ЭД для всех шаблонов и повторить попытку.'");
		Сообщение.Сообщить();
		
		Результат = Ложь;
	КонецЕсли;	

	Если НастройкиФормированияФормуляров.Количество() = 0 Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru='Необходимо сохранить настройки списка печатных форм для шаблонов (шаг 3) и повторить попытку.'");
		Сообщение.Сообщить();
		
		Результат = Ложь;
	КонецЕсли;	
	
	Возврат Результат;
КонецФункции

Функция НетЗамечанийПриПроверкеСпискаДокументовУчета()
	Результат = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ПредметыДляФормированияФайловПредставленийФормуляровПОД.Предмет КАК Предмет,
	               |	ПредметыДляФормированияФайловПредставленийФормуляровПОД.Шаблон КАК Шаблон
	               |ИЗ
	               |	РегистрСведений.ПредметыДляФормированияФайловПредставленийФормуляровПОД КАК ПредметыДляФормированияФайловПредставленийФормуляровПОД";

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат = Истина;
	КонецЦикла;	
	
	Возврат Результат;
КонецФункции	

&НаСервере
Процедура СохранитьНастройкиСпискаПечатныхФормДляШаблоновНаСервере()
	УстановитьПривилегированныйРежим(Истина);
	
	НаборЗаписейНастройки = РегистрыСведений.НастройкиФормированияФайловПредставленийФормуляровПОД.СоздатьНаборЗаписей();
	НаборЗаписейНастройки.Записать();

	Для Каждого ТекСтрока Из Объект.ШаблоныДокументов Цикл
		НоваяЗапись = РегистрыСведений.НастройкиФормированияФайловПредставленийФормуляровПОД.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(НоваяЗапись, ТекСтрока);
		НоваяЗапись.Записать(Ложь);
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры

&НаСервере
Процедура ЗагрузкаНастроекФормированияФайловПредставленийФормуляров()
	ДанныеНастроек = ПроцессыОбработкиДокументов.НастройкиФормированияФайловПредставленийФормуляровДокументовПрошлыхПериодов();
	
	Объект.ШаблоныДокументов.Загрузить(ДанныеНастроек);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПериод_Выбор(РезультатВыбора, ПараметрыОповещения) Экспорт
	
	Если ТипЗнч(РезультатВыбора) = Тип("Структура") Тогда
		Объект["НачалоПериода"]	= РезультатВыбора["НачалоПериода"];
		Объект["КонецПериода"]	= РезультатВыбора["КонецПериода"];
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
